{
    "aboutMe": [
        {
            "isTitle": true,
            "text": "Hello World"
        },
        {
            "isTitle": false,
            "text": "My name is Seçkin. I was born in 2001 in Antalya. I've studied in Antalya till university. Now I study Computer Science in Bilkent University, planning to graduate on 2023. I've done an internship in 2021 summer and looking for one for next year. Please see /projects and /skills"
        },
        {
            "isTitle": true,
            "text": "My Interests"
        },
        {
            "isTitle": false,
            "text": "I am fond of computer science and maths. In not so scientific but enthusiastic ways, I am into Physics and Linguistics."
        },
        {
            "isTitle": false,
            "text": "I am very much into Music. I enjoy many songs in genres ranging from Metal to Turkish Classical Music. I've been playing guitar for 10+ years with not much practice but regular jams mostly in groups. In highschool, I got interested in maths behind Music. I also was interested in painting, assembling and even crafing(failed) instruments. I also not so confidently play harmonica, cura and sing."
        },
        {
            "isTitle": false,
            "text": "I don't play any computer games since 2017, I forced myself to stop that year. But I still love to hold conversations about some, especially Gta San Andreas."
        },
        {
            "isTitle": false,
            "text": "I sometimes can enjoy literature and frequently enjoy reading about random things. I am into geography, cultures and a bit less into history, but not politics. If I had more time and money, I would be traveling more."
        }
    ],
    "projects": [
        {
            "title": "Junior Year - Fall School Work",
            "date": "~December 2021",
            "description": "Some of my school projects are compiled on github with a readMe. Took CS courses: CS 315: Programing Languages, CS 319: Object Oriented Software Engineering, CS 421: Computer Networks, CS 464: Introduction to Machine Learning.",
            "links": [
                {
                    "title": "Github",
                    "link": "https://github.com/seco-lorem/SchoolWork#user-content-junior-years-fall"
                }
            ]
        },
        {
            "title": "Portfolio Page",
            "date": "August 2021",
            "description": "My portfolio site that you are probably on right now. As I was unhappy about my css work in satvi, I saw my need of a portfolio website to prove that I can write more quality css. I've implemented the design my industrial designer friend noted in the footer came up with. I've used React, react-router, vanilla CSS and JSX.",
            "links": [
                {
                    "title": "🔗WebSite",
                    "link": "https://yektaseckinsatir.com/"
                },
                {
                    "title": "Github",
                    "link": "https://github.com/seco-lorem/PortfolioPage"
                }
            ]
        },
        {
            "title": "SatVI",
            "date": "July 2021",
            "description": "Craiglist-like WebSite. I've first started this project with its frontend, using it as a learning and testing playground during the internship. Last week of internship I've started learning backend with help of an intern friend. After Internship, I decided to build a backend. Technologies used in frontend are javascript(React), redux(react-redux), react-router, apollo client(GraphQL), reactstrap(bootstrap), vanilla CSS, JSX. Technologies used in backend are Python, fastapi, graphene(GraphQL), sqlAlchemy. Frontend also includes a video player I created when I was asked if it was possible to build such a thing for advertisements. I've used deta to deploy backend as read-only, firebase to deploy frontend. It is not finished, as it was never intended to be.",
            "links": [
                {
                    "title": "🔗WebSite",
                    "link": "https://satvi.yektaseckinsatir.com/"
                },
                {
                    "title": "Demo Video",
                    "link": "https://user-images.githubusercontent.com/62249520/130761281-bb66bc26-235e-4a86-8119-932930483ce5.mp4"
                },
                {
                    "title": "Github",
                    "link": "https://github.com/seco-lorem/SatVI"
                }
            ]
        },
        {
            "title": "WCDTTBot",
            "date": "June 2021",
            "description": "Bot for an experimental private subreddit that weekly: Adds random users, Adjusts ranks and adds them as userflairs, Kicks inactive users depending on their ranks, posts a recap about it. A Python project with internet friends that uses PRAW.",
            "links": [
                {
                    "title": "Github",
                    "link": "https://github.com/seco-lorem/WCDTTBot"
                }
            ]
        },
        {
            "title": "Somphomore Year School Work",
            "date": "~May 2021",
            "description": "Some of my school projects are compiled on github with a readMe. Took CS courses: CS 201 & CS 202: Fundamental Structures of Computer Science I & II, CS 223: Digital Design, CS 224: Computer Organization.",
            "links": [
                {
                    "title": "Github",
                    "link": "https://github.com/seco-lorem/SchoolWork#user-content-sophomore--freshman-years"
                }
            ]
        },
        {
            "title": "Relativity-Simulator",
            "date": "July 2020",
            "description": "This project is to help understanding the consequences of the special relativity theory, by setting the speed of light to an understandably-slow value of 100px per second. Made up of neatly Object Oriented Java code. See better documentation on github link. Consists of 2 seperate parts: 1, Lets the user draw a 2d shape on one of the two time-location graph's, which show identical universes viewed by two reference frames with a constant velocity difference. 2, Lets the user control the speed of a reference frame and view a fixed portion of the space containing 3 randomly created creatures from that frame of reference.",
            "links": [
                {
                    "title": "Github",
                    "link": "https://github.com/seco-lorem/RelativitySimulator"
                }
            ]
        },
        {
            "title": "MonitoRing",
            "date": "June 2020",
            "description": "MonitoRing is an app where bus(Ring) drivers of Bilkent University log in to share their location data via firebase, and the users can see it on an integrated Google Maps API with routes and bus stops. So the students, teachers and the staff will be able to plan their transportation more efficiently. It is a school project with 5 people, an android app written in Adroid studio with Java.",
            "links": [
                {
                    "title": "Small Demo",
                    "link": "https://github.com/seco-lorem/SchoolWork/tree/main/MonitoRING"
                }
            ]
        }
    ],
    "skills": [
        {
            "name": "React Javascript",
            "explanation": "Used in internship as a web developer. Note that SatVI contains my first react code written for test and learning purposes aswell. Latest components I've written in SatVI were sidebar.js and carousel.js",
            "examples": [
                {
                    "title": "SatVI",
                    "link": "https://github.com/seco-lorem/SatVI"
                },
                {
                    "title": "Portfolio Page",
                    "link": "https://github.com/seco-lorem/PortfolioPage"
                }
            ]
        },
        {
            "name": "C++ & Data Structures",
            "explanation": "Learnt during my sophomore year. I can say I've comprehended the concepts well.",
            "examples": [
                {
                    "title": "A Homework",
                    "link": "https://github.com/seco-lorem/SchoolWork/tree/main/CS201HW4"
                }
            ]
        },
        {
            "name": "Java & OOP",
            "explanation": "Learnt during my freshmen year. We've also used Spring but I don't remember much about it.",
            "examples": [
                {
                    "title": "Relativity Sim",
                    "link": "https://github.com/seco-lorem/RelativitySimulator/"
                },
                {
                    "title": "MonitoRing",
                    "link": "https://github.com/seco-lorem/SchoolWork/tree/main/MonitoRING"
                }
            ]
        },
        {
            "name": "Python",
            "explanation": "Learnt for side projects like Reddit bot(PRAW) and satVI-backend(fastAPI, sqlAlchemy, graphQL). I am less experienced in Python than others but it is the language I love the most to learn some Library of.",
            "examples": [
                {
                    "title": "WCDTTBot",
                    "link": "https://github.com/seco-lorem/WCDTTBot"
                },
                {
                    "title": "SatVI",
                    "link": "https://github.com/seco-lorem/SatVI"
                }
            ]
        },
        {
            "name": "Assembly(MIPS)",
            "explanation": "Learnt it in Computer Architecture class. I was good at it but haven't used it since.",
            "examples": [
                {
                    "title": "A Homework",
                    "link": "https://github.com/seco-lorem/SchoolWork/tree/main/CS224LABS"
                }
            ]
        },
        {
            "name": "SystemVerilog & Hardware",
            "explanation": "Used it in Digital Design and Computer Architecture classes.",
            "examples": [
                {
                    "title": "A Homework",
                    "link": "https://github.com/seco-lorem/SchoolWork/tree/main/CS224LABS"
                }
            ]
        },
        {
            "name": "CSS-HTML",
            "explanation": "Learnt it prior to my internship in web development. I did not use plain html but did use JSX which extends it.",
            "examples": [
                {
                    "title": "Portfolio Page",
                    "link": "https://github.com/seco-lorem/PortfolioPage"
                }
            ]
        },
        {
            "name": "Waterfall Methodology & UML",
            "explanation": "Principles and stages of software development.",
            "examples": [
                {
                    "title": "CS 319 Term Project",
                    "link": "https://github.com/seco-lorem/YACM"
                }
            ]
        },
        {
            "name": "Machine Learning",
            "explanation": "Learnt the fundamentals of machine learning in CS 464.",
            "examples": [
                {
                    "title": "CS 464 Term Project",
                    "link": "https://github.com/larafenercioglu/emotion_detection"
                }
            ]
        },
        {
            "name": "Programming Languages",
            "explanation": "In CS 315 worked with lex and yacc, got introduced to functional programming using Scheme, explored the concepts of numerous programming languages which include: C, C++, C#, Dart, GoLang, Javascript, Perl, PHP, Python, Rust.",
            "examples": [
                {
                    "title": "CS 315 Project & a Homework",
                    "link": "https://github.com/seco-lorem/SchoolWork/tree/main/CS315"
                }
            ]
        },
        {
            "name": "Internet Comprehension",
            "explanation": "In CS 421, Internet and Computer Networks were covered in detail. Started from application layer, covered till link layer",
            "examples": [
                {
                    "title": "HTTP Homework",
                    "link": "https://github.com/seco-lorem/SchoolWork/tree/main/ParallelFileDownloader"
                }
            ]
        }
    ],
    "links": [
        {
            "title": "Github",
            "link": "https://github.com/seco-lorem"
        },
        {
            "title": "CV",
            "link": "seckin-resume.pdf"
        },
        {
            "title": "Linked in",
            "link": "https://www.linkedin.com/in/yektaseckin"
        },
        {
            "title": "e-mail",
            "link": "mailto: seckin.satir@ug.bilkent.edu.tr"
        }
    ],
    "photoLink": "https://i.hizliresim.com/619c314.jpg",
    "projectsExplanation": "Below are my projects in descending order by dates. Note that some of them are from my first months of programming so I'm not proud of each one of them.",
    "skillsExplanation": "Hover on each skill to see the latest projects I had used them in, and how confident I feel about those skills."
}